** directory

#+BEGIN_SRC sh :results output :exports both
sh ~/COMM/bin/lstree abstract_factory
#+END_SRC

#+RESULTS:
#+begin_example
abstract_factory@Sun Feb  5 15:18:34 JST 2017
+-animal.rb
+-animals-+-duck.rb
|         +-frog.rb
+-organism_factories-+-duck_and_waterlily.rb
|                    +-frog_and_algae.rb
+-organism_factory.rb
+-plant.rb
+-plants-+-algae.rb
|        +-waterlily.rb
+-test_duck_and_waterlily_factory.rb
+-test_frog_and_algae_factory.rb
#+end_example


** test

#+BEGIN_SRC ruby :tangle abstract_factory/test_frog_and_algae_factory.rb :results output
$: << "."

require 'abstract_factory/organism_factory'
require 'abstract_factory/organism_factories/frog_and_algae'

factory = FrogAndAlgaeFactory.new(4,1)
animals = factory.get_animals
animals.each do |animal| 
  animal.eat
end

plants = factory.get_plants
plants.each do |plant|
  plant.grow
end


#+END_SRC

#+RESULTS:
#+begin_example
frog 動物0 は食事中です.
Animalは食べるものですから。
frog 動物1 は食事中です.
Animalは食べるものですから。
frog 動物2 は食事中です.
Animalは食べるものですから。
frog 動物3 は食事中です.
Animalは食べるものですから。
藻 植物0 は成長中です.
Plant は成長するものですから。
#+end_example



#+BEGIN_SRC ruby :tangle abstract_factory/test_duck_and_waterlily_factory.rb :results output
$: << "."

require 'abstract_factory/organism_factory'
require 'abstract_factory/organism_factories/duck_and_waterlily'

factory = DuckAndWaterLilyFactory.new(4,1)
animals = factory.get_animals
animals.each do |animal| 
  animal.eat
end

plants = factory.get_plants
plants.each do |plant|
  plant.grow
end


#+END_SRC

#+RESULTS:
: duck 動物0 は食事中です.
: Animalは食べるものですから。
: duck 動物1 は食事中です.
: Animalは食べるものですから。
: duck 動物2 は食事中です.
: Animalは食べるものですから。
: duck 動物3 は食事中です.
: Animalは食べるものですから。
: 睡蓮 植物0 は成長中です.

